#ifndef __AP3216C_H
#define __AP3216C_H
#include "type.h"
#define AP3216C_ADDR    	0X1E	/* AP3216C器件地址 */

/* AP3316C寄存器 */
#define AP3216C_SYSTEMCONG	0x00	/* 配置寄存器      */
#define AP3216C_INTSTATUS	0X01	/* 中断状态寄存器  */
#define AP3216C_INTCLEAR	0X02	/* 中断清除寄存器  */
#define AP3216C_IRDATALOW	0x0A	/* IR数据低字节    */
#define AP3216C_IRDATAHIGH	0x0B	/* IR数据高字节    */
#define AP3216C_ALSDATALOW	0x0C	/* ALS数据低字节   */
#define AP3216C_ALSDATAHIGH	0X0D	/* ALS数据高字节   */
#define AP3216C_PSDATALOW	0X0E	/* PS数据低字节    */
#define AP3216C_PSDATAHIGH	0X0F	/* PS数据高字节    */

/**********************************************************************
 * 函数名称： ap3216c_init
 * 功能描述： 初始化
 * 输入参数： 1.设备地址 2.要读的寄存器
 * 输出参数： 无
 * 返 回 值： 无
 * 修改日期           版本号     修改人	      修改内容
 * -----------------------------------------------
 * 2020/02/22	     V1.0	    小火山	      创建
 ***********************************************************************/
unsigned char ap3216c_init(void);

/**********************************************************************
 * 函数名称： ap3216c_read_data
 * 功能描述： 向IC从设备读数据
 * 输入参数： 1.设备地址 2.要读的寄存器
 * 输出参数： 无
 * 返 回 值： 无
 * 修改日期           版本号     修改人	      修改内容
 * -----------------------------------------------
 * 2020/02/22	     V1.0	    小火山	      创建
 ***********************************************************************/
void ap3216c_read_data(uint16_t *ir, uint16_t *ps, uint16_t *als);

#endif


